<template>
    <div class="wrapper">
      <div class="moduleHead">
        <a href="javascript:window.history.go(-1)"></a>关于少儿编程
      </div>
      <div class="city-container">
        <p>提起<span>少儿编程</span>，很多人都听说过，那么什么是少儿编程呢？少儿编程到底是学什么的呢？</p>
        <p>如果单从字面上的意思来解释的话，也就是少儿进行编程学习。很多家长就会想了，我的孩
          子，以后又不一定要当个程序员，从小学编程有什么用。</p>
        <p>其实，从一开始对少儿编程的理解就发生了错误，少儿编程的重
          点不是编程，而是学习思维。因为学习少儿编程，能够培养孩子解决
          问题的能力和创新思考的能力，当孩子们掌握初级的算法之后，他们
          的自学能力和学习新知识的能力也能够大大的提高。</p>
        <img src="../../assets/image/swipe/sw2.jpg" alt="">
        <p>中国的大多数孩子在遇到问题的时候很多都不会去主动思考，而是直
          接问家长，老师，同学，自己不需要思考就能依靠他人解决问题。</p>
        <p>
          但编程不是给孩子们提问题的，它的目的不在于结果，注重的是孩子思维
          的过程。孩子们在编程的过程中自己去发现问题，再去思考如何改进程序并
          解决问题，从而进一步优化程序。在优化程序或者说编写程序的过程中方法也
          有很多种，孩子可以根据不同情况选择不同的方法，从而学会多途径解决问题。
        </p>
        <p>
          编程培养的是学生的综合能力，例如思维能力（学会用不同的语言，句式，代码解决同一个问题）
          ，创新力（编写程序的过程都是自己去设计并完成的），观察力（编写程序的过程中必然会出现问
          题，需要自己不停尝试和仔细观察，从而发现问题并解决），主动思考的能力（例如一个软件或系
          统如何让客户用起来更方便，就需要设计者在测试的时候不断发现问题并解决，从而去改进程序。其
          实这个过程也是一个提出问题并解决问题的过程）。这些能力对孩子来说是受益终生的。
        </p>
        <p><span>针对少儿编程教育，家长普遍有以下几点误区：</span></p>
        <p><span>1.</span>很多不熟悉少儿编程的家长，以为学编程是学这样的天书：</p>
        <img src="../../assets/image/code.png" alt="">
        <p>其实，现在孩子学编程是通过程序积木完成编程的，界面很友好：</p>
        <img src="../../assets/image/scratch.png" alt="">
        <p>以目前最流行的Scratch编程工具为例，孩子们可以通过
          拖动和拼搭积木块创建自己的项目，编写自己的故事，完
          成自己的艺术和音乐创作。</p>
        <p><span>2.</span>我家孩子又不当程序员，为啥学编程？还要这么早？</p>
        <p>少儿编程教育，并非是要把孩子培养成程序猿。其实，编程教育更多的是在训
          练孩子的思维，提升孩子解决问题的能力。编程是一件很有趣的事情，至少能培养
          五个方面的能力：策划构思能力、逻辑分析能力、模式识别能力、问题分解能力、测
          试纠错能力。这些重要的思维能力，不光在编程上很重要，也适用于各行各业。
        </p>
        <P>
          而且，通过我们实际的教学观察，一个学过编程的孩子和没有学
          过编程的同龄孩子，在思维方式上会有非常明显的差异，经过训练之
          后，孩子们会具备清晰简洁的逻辑思维，问题分解能力、问题解决能
          力都会得到提高，而没有经过训练的孩子，他的思维方式会逐步固化，
          到后面很难调整过来，这也是为什么我们鼓励孩子从小就学习编程的原
          因。编程能力或许就是一个让孩子受益终身的能力，能让孩子在任何领域做得更好。
        </P>
        <p><span>3.</span>学习编程一定要智商很高？</p>
        <p>许多家长或许以为，编程一定是一件需要高智商的事，我家孩子智商一般，根本学不会！
          其实不然，少儿编程教育在美国、英国等发达国家，现已作为基础教育在中小学阶段广泛
          普及，这并不是少数孩子的权利。</p>
        <p><span>4.</span>女孩子不擅长学编程?</p>
        <p>
          有些家长会觉得，编程是男孩子才擅长的，女孩子在逻辑思想上没有优势，
          没有必要学习编程。 根据国内外的研讨数据，在计算机编程范畴，
          女孩完全不弱于男孩，在思想的严谨性等方面甚至比男孩更有优势。
          Google公司工程师的性别份额是1:1，女孩同样擅长编程。
        </p>
        <p><span>5.</span>我家孩子还小，学习少儿编程是不是超前教育？</p>
        <p>一部分家长或许觉得，现在孩子们的升学压力那么大，许多的课外补习已经压得孩子喘不过气来，
          学习编程不该在中小学，进入大学后想怎样学都行！
          先看看图形化少儿编程在全球的数据，在美国超越44%的中小学生学习少儿编程，而我国不到1%。
          根据世界知名教育专家的观点，少儿编程教育并非超前教育，而是结合科学、数学、
          工程学知识的创新学科，是符合未来时代需求的知识。孩子应该减少应试教育的补习，尽早接触少儿编程。</p>
        <p><span>6.</span>少儿编程对升学有用吗？</p>
        <p>有一些家长认为，孩子在中小学阶段主要任务是升学，一切
          对升学没有帮助的事情都不要去做。
          其实，让孩子学习少儿编程是家长们最“功利”的投资了。
          我国各大高校都有自主招生政策，主要面向科技创新型人才，其中以
          计算机编程为核心。如果你的孩子在学习少儿编程的过程产生了兴趣
          ，在初高中阶段开始参加信息学奥赛等竞赛（NOIP、NOI）。
          只要获得省级竞赛一、二、三等奖就可以申请全国数十所985/211名校的自
          主招生，可以获得高考降30分或降到一批线录取资格，甚至清华、北大免试录取！</p>
        <img src="../../assets/image/download.png" alt="">
      </div>
    </div>
</template>

<script>
    export default {
        name: "aboutProgram"
    }
</script>

<style scoped lang="less">
  @import "../../assets/less/city";
</style>
