<template>
    <div class="wrapper">
      <div class="moduleHead">
        <a href="javascript:window.history.go(-1)"></a>一线形势
      </div>
      <div class="city-container">
        <p><span>芒果编程</span> 整理了165家少儿编程公司资料，梳理出了目前该赛道公司地域分布、融资状况、
          以及关注少儿编程的投资机构等多个维度的数据，全方位的把该赛道展示出来。
        </p>
        <div class="statistical-container">
          <img src="../../assets/image/fenbu.jpg" alt="">
          <h4>少儿编程公司地域分布</h4>
          <p><span>统计时间：2018.08</span><span>数据来源：互联网公开数据</span></p>
        </div>
        <p>整个行业在融资方面仍然处于初期阶段，统计的165家公司中有111家公司未披露融资情况。</p>
        <div class="statistical-container">
          <img src="../../assets/image/tongji.jpg" alt="" style="width: 95%">
          <h4>少儿编程公司融资分布</h4>
          <p><span>统计时间：2018.08</span><span>数据来源：互联网公开数据</span></p>
        </div>
        <p>上图中，学习少儿编程的主要公司分布在华北、华南以及华东，而分布的具体城市如下图：</p>
        <img src="../../assets/image/fb.jpg" alt="">
        <p>上图中，主要的编程公司主要都是分布在一线城市，那为什么编程公司要选择在一线城市发展呢？
          而三四线城市都没有他们的身影呢？<span>芒果编程</span>做了一个市场调查，大概有以下几点：
        </p>
        <p><span>第一类是高知家长。</span>
          家长通常有很好的教育背景，接触的信息比较多，对国内的教育有清醒的
          认识，对国外的教育也相对熟悉，教育理念偏国际化。家长对于孩子的教
          育有非常明确的规划，认为孩子就应该学习编程，家长更会主动寻求好的编
          程课程让孩子来学习。这类家长所占的比例并不多（大约只有5%左右），但
          对于其身边的家长通常具有很大的影响力。
        </p>
        <p><span>第二类是中高产家长。</span>家长对于孩子教育普遍比较重视，对于
          新鲜事物尝试意愿很高，愿意让孩子接受更多素质方面的教育，会四处打听、
          尝试、对比优质的课程内容。当然有时候也会跟风，妈妈群体中的意见领袖一
          推荐，家长们可能就会蜂拥而上，为孩子报名编程课。暑假期间，笔者所招收
          的几百名孩子中超过一半是来自于家长之间的推荐。这类家长是目前编程教育
          的主流人群，大约能占到70%。
        </p>
        <p><span>第三类是偏应试教育的家长。</span>比较关心编程教育学完之后，孩子能
          获得什么证书，是否对孩子升学有帮助，能否加分。这部分家长大概能占到20%。
        </p>
        <p><span>最后一类是孩子沉迷于网络游戏的家长。</span>
          家长希望通过学习编程，让孩子对游戏有新的认识，并能逐步从游戏中解脱出来。这类家长大约占到5%。</p>
        <h3>一线城市，少儿编程培训已经慢慢成长起来了。随着计算机知识的普及，
          现在各地的少儿编程都朝着较好的方向在发展，加上编程已加入一些地方高考（如浙江）的
          考核范围，家长对编程的认知会越来越多，普及起来就没这么困难了。</h3>
        <p><span>在调查的同时，我们也遇到了许多对少儿编程的误解：</span></p>
        <p><span>家长方面：</span>
          外界关于少儿编程的信息太少，导致部分家长不太了解少儿编程。尤其非IT专业的家长更是如此。另外编程
          课在我国普及不大，地位也不如语、数、外等这些能够直接体现还在成绩的科目。</p>
        <p><span>学校方面：</span>编程教育需要比较大的投入，而且效果没保障，和文化课相比还是处于次要地位。
          但是有一些学校领导还是有超前眼光的，他们给自己的学生开设了信息学
          课程，从小就让孩子学习编程。据了解，有些四年级的小学生已经跟着学校的老师学习C++
          了为信息学做准备了。</p>
        <p><span>老师方面：</span>部分老师还是固守着文化课成绩第一的观念，
          觉得编程可能会占据孩子的学习时间，另外不是所有的孩子学编程都会取得好成绩，
          至于参加NOIP就更难了。</p>
        <p><span>地域方面：</span>
          一些经济比较发达的地区，能够接受到最新的信息和世界趋势，这也影响了家长的决策。
          相比一线城市，三四线城市的家长还没意识到编程的重要性。微信后台数据显示，北
          京、上海、广州用户最多。</p>
      </div>

    </div>
</template>

<script>
    export default {
        name: "city"
    }
</script>

<style scoped lang="less">
  @import "../../assets/less/city";
</style>
