<template>
    <div class="wrapper">
      <div class="moduleHead">
        <a href="javascript:window.history.go(-1)"></a>政策鼓励
      </div>
      <div class="peContainer">
        <p>
          近两年来，随着人工智能的发展，以及国家对STEAM教育的政策支持，
          被称为“世界第三门语音”的编程正逐步走进大众的视野。关于儿童的编
          程教育，大众会有一个常见的误区，认为儿童的编程教育是让孩子去写代码，
          是培养年轻的程序员。但其实，学习编程是帮孩子提升计算思维能力，锻
          炼他们的想象力和项目式解决问题的能力，更好地服务于孩子整体知识架
          构及思维体系的建立。
        </p>
        <p>那么，在少儿编程赛道上，有哪些国家政策在不断驱动这一行业的飞速发展呢？</p>
        <table border="1">
          <tr>
            <th class="pe-year">时间/年</th>
            <th class="pe-country">国家</th>
            <th class="pe-action">事件</th>
            <th class="pe-permeability">渗透率</th>
          </tr>
          <tr>
            <td>2000</td>
            <td>以色列</td>
            <td><p>将编程纳入高等学校的必修科目。同时要求孩子从一年级就要学习编程。</p></td>
            <td>——</td>
          </tr>
          <tr>
            <td>2012</td>
            <td>日本</td>
            <td><p>中小学中普及编程教育科目。</p></td>
            <td>4.2%</td>
          </tr>
          <tr>
            <td>2014</td>
            <td>英国</td>
            <td><p>教育大纲规定计算机编程是5-16岁儿童必修课程。</p></td>
            <td>9.3%</td>
          </tr>
          <tr>
            <td>2015</td>
            <td>芬兰</td>
            <td><p>尝试对10-12岁儿童，进行由IT公司和科技行业举办的以编程为主导的课程教育。</p></td>
            <td>8.9%</td>
          </tr>
          <tr>
            <td>2015</td>
            <td rowspan = "2">美国</td>
            <td><p>政府投资40亿美元开展少儿编程教育，呼吁全国青少儿学习编程。</p></td>
            <td rowspan = "2">44.8%</td>
          </tr>
          <tr>
            <td>2016</td>
            <td><p>美国国情咨文推行计算机科学教育，强制要求高中毕业必修计算机编程学分。</p></td>
          </tr>
          <tr>
            <td>2016</td>
            <td>澳大利亚</td>
            <td><p>政府投入1200万美元，用以展开STEM教学，并正式将coding引入全国必修课中。</p></td>
            <td>10.3%</td>
          </tr>
          <tr>
            <td rowspan = "2">2017</td>
            <td>新加坡</td>
            <td><p>全面推动少儿编程教育，中小学考试中加入编程考试科目。</p></td>
            <td>——</td>
          </tr>
          <tr>
            <td>加拿大</td>
            <td><p>从幼儿园到高中的学子，需要开始学习编程技能和其他数字技能。</p></td>
            <td>7.2%</td>
          </tr>
          <tr>
            <td>2018</td>
            <td>韩国</td>
            <td><p>开始全面开始推广中学编程。</p></td>
            <td>——</td>
          </tr>
        </table>
        <p>国外少儿编程起步早于国内，且发展较为成熟，政府对于少儿编程的政策与资金支持，
          是该行业在国外迅速发展的主要驱动因素。目前，全球有超24个国家，包括日本，韩国，
          以及欧洲多个国家，已经将编程教育纳入K12课程大纲或者教学场景。</p>
        <p>
          而我国少儿编程的发展则慢于发达国家，真正火起来可追溯到2014年——浙江省高考开始加入编程课程。
        </p>
        <table border="1">
          <tr>
            <th class="pe-year">时间</th>
            <th>事件</th>
          </tr>
          <tr>
            <td>2014年</td>
            <td>
              <p>浙江省高考改革方案，将信息技术科目（含编程）加入高考</p>
            </td>
          </tr>
          <tr>
            <td>2016年</td>
            <td><p>
              《教育信息化“十三五”规划》将信息化教学能力纳入学习办学水平考核。
            </p></td>
          </tr>
          <tr>
            <td>2016年6月</td>
            <td>
              <p>教育部印发《教育信息化“十三五”规划》通知，将信息化教学能力纳入学校办学水平考评体系。
                有条件的地方要积极探索信息技术在众创空间、跨学科学习（STEAM教育）、创客教育等新的教育模式的应用。</p>
            </td>
          </tr>
          <tr>
            <td>2017年1月</td>
            <td><p>《义务教育小学科学课程标准》将小学科学课提前到小学一年级。</p></td>
          </tr>
          <tr>
            <td>2017年7月</td>
            <td><p>《国务院关于印发新一代人工智能发展规划的通知》中指明，国家对于
              人工智能人才的迫切需求，要求实施全民智能教育项目，在中小学阶段设置
              人工智能相关课程，逐步推广编程教育，鼓励社会力量参与寓教于乐的编程
              教学软件、游戏的开发和推广。在《规划》中有明确表示，我国将在2030年
              建设成为创新型国家和世界科技强国。</p>
            </td>
          </tr>
          <tr>
            <td>2017年10月</td>
            <td><p>《十九大报告》进一步强调网络强国战略，加强前沿引领技术、现代工程技术 、
              颠覆性技术创新，突破核心技术这个难题，争取在某些领域、某些方面实现“弯道超车”。</p>
            </td>
          </tr>
          <tr>
            <td rowspan="3">2018年</td>
            <td><p>《新一代人工智能发展规划》，提出在中小学阶段推广编程教育。</p></td>
          </tr>
          <tr>
            <td><p>全国计算机等级考试自2018年3月份 开始加入Python程序语言。</p></td>
          </tr>
          <tr>
            <td><p>山东省最新出版小学信息技术六年级教材加入Python内容。</p></td>
          </tr>
          <tr>
            <td>2019年</td>
            <td><p>广东省将信息技术（含编程）加入高考内容。</p></td>
          </tr>
          <tr>
            <td>2022年</td>
            <td><p>2022年起，全国一线城市初高中将加入编程必修课 </p></td>
          </tr>
        </table>
        <img src="../../assets/image/policy.jpg" alt="">
      </div>
    </div>
</template>

<script>
  export default {
      name: "policyEncourage"
  }
</script>


<style scoped lang="less">
  @import "../../assets/less/index";
</style>
